/**
 * 2019 年西工大计算机考研机试题



1. 排序：输入n，有n组测试数据

输入样例：

2

5 7 3 2 11 23 6 33

9 8 5 2 1 3 0 4

输出样例

2 3 5 6 7 11 23 33

0 1 2 3 4 5 8 9



2. 输入三角形的三条边，判断它们能否构成三角形，如果不能，输出NaN,如果能，输出三角形面积，结果保留两位小数。

输入样例：

2

1.0  2.0  3.0

3.0  4.0  5.0



输出样例

NaN

6.00



3. 判断IP地址

输入n行字符串，判断输入的是否为合法的IP地址，如果是有效的IP输出yes，否则输出no

输入样例：

2

1.2.3.4

172.168.0.300

输出样例

yes

no



4. 输入两个日期，求两个日期之间的天数，如果两个日期是连续的我们规定他们之间的天数为两天，输入n组数据进行测试。

输入样例：

2

2019 3 20 2019 3 21

2019 1 1 2019 2 28

输出样例

2

59



5. 输出从M开始的N个素数

输入样例：

2  5

输出样例

3

5

7

11

13

*/