//线性表的定义：线性表是具有相同数据类型的n个数据元素的有限序列，n为表长。n=0时表是空表
//线性表的特点：
//          1）表中元素个数有限
//          2）表中元素具有逻辑上的顺序性，表中元素由其先后次序
//          3）表中元素都是数据元素，每个元素都是单个元素
//          4）表中元素的数据类型都相同，每个元素占用相同大小的存储空间
//          5）表中元素具有抽象性，即讨论元素之间的逻辑关系，而不是考虑元素究竟表示什么内容

//线性表基本操作：
//初始化表
//求表长
//按值查找
//按位查找
//插入
//删除
//输出
//判空
//销毁

//---------------------顺序表
//线性表的顺序存储称为线性表
//1）随机访问，O(1)内找到第i个元素
//2）存储密度高，每个节点只存储数据元素
//3）拓展容量不方便
//4）插入、删除操作不方便，需要移动大量元素
//5）逻辑顺序与物理顺序相同

//---------------------单链表
//线性表的链式存储称为单链表
